http-tests/approved.xml

<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:loan="http://www.javatechie.com/spring/soap/api/loanEligibility">
  <soapenv:Header/>
  <soapenv:Body>
    <loan:CustomerRequest>
      <loan:customerName>Karel de Rijke</loan:customerName>
      <loan:age>55</loan:age>
      <loan:yearlyIncome>400000</loan:yearlyIncome>
      <loan:cibilScore>700</loan:cibilScore>
      <loan:employmentMode>govt</loan:employmentMode>
    </loan:CustomerRequest>
  </soapenv:Body>
</soapenv:Envelope>
